Repository: qizhangumich/app-factory-agent
Catalog: workspaces/ws_002_unitconverterpro/ios/UnitConverterPro/Localizable.xcstrings
Source language: en
Languages: de, ja

# app_name
source: Unit Converter Pro
de: Einheitenrechner Pro
ja: 単位変換プロ

# tab_convert
source: Convert
de: Umrechnen
ja: 変換

# tab_history
source: History
de: Verlauf
ja: 履歴

# search_prompt
source: Search categories or units
de: Kategorien oder Einheiten suchen
ja: カテゴリーや単位を検索

# section_favorites
source: Favorites
de: Favoriten
ja: お気に入り

# section_categories
source: Categories
de: Kategorien
ja: カテゴリー

# section_unit_results
source: Matching Units
de: Passende Einheiten
ja: 一致する単位

# section_related
source: Related Conversions
de: Verwandte Umrechnungen
ja: 関連する変換

# label_from
source: From
de: Von
ja: 変換元

# label_to
source: To
de: Nach
ja: 変換先

# action_copy
source: Copy Result
de: Ergebnis kopieren
ja: 結果をコピー

# action_favorite
source: Favorite
de: Favorit
ja: お気に入り

# action_unfavorite
source: Favorited
de: Favorisiert
ja: 登録済み

# action_clear_all
source: Clear All
de: Alle löschen
ja: すべて消去

# action_cancel
source: Cancel
de: Abbrechen
ja: キャンセル

# confirm_clear_title
source: Clear all history?
de: Gesamten Verlauf löschen?
ja: すべての履歴を消去しますか？

# toast_copied
source: Copied to clipboard
de: In die Zwischenablage kopiert
ja: クリップボードにコピーしました

# history_empty_title
source: No History Yet
de: Noch kein Verlauf
ja: 履歴はまだありません

# history_empty_message
source: Conversions you make will appear here.
de: Ihre Umrechnungen erscheinen hier.
ja: 実行した変換がここに表示されます。

# a11y_swap
source: Swap units
de: Einheiten tauschen
ja: 単位を入れ替える

# a11y_favorite
source: Add to favorites
de: Zu Favoriten hinzufügen
ja: お気に入りに追加

# a11y_unfavorite
source: Remove from favorites
de: Aus Favoriten entfernen
ja: お気に入りから削除

# a11y_open_category
source: Open converter
de: Umrechner öffnen
ja: 変換ツールを開く

# a11y_unit_picker
source: Unit picker, currently %@
de: Einheitenauswahl, aktuell %@
ja: 単位選択、現在は%@

# a11y_favorite_pair
source: %1$@ to %2$@, %3$@ category
de: %1$@ zu %2$@, Kategorie %3$@
ja: %1$@から%2$@、%3$@カテゴリー

# a11y_history_row
source: %1$@ %2$@ equals %3$@ %4$@
de: %1$@ %2$@ entspricht %3$@ %4$@
ja: %1$@ %2$@ は %3$@ %4$@ に等しい

# cat_length
source: Length
de: Länge
ja: 長さ

# cat_weight
source: Weight
de: Gewicht
ja: 重さ

# cat_temperature
source: Temperature
de: Temperatur
ja: 温度

# cat_speed
source: Speed
de: Geschwindigkeit
ja: 速度

# cat_volume
source: Volume
de: Volumen
ja: 体積

# cat_area
source: Area
de: Fläche
ja: 面積

# cat_data
source: Data Storage
de: Datenmenge
ja: データ容量

# cat_time
source: Time
de: Zeit
ja: 時間

# cat_pressure
source: Pressure
de: Druck
ja: 圧力

# cat_energy
source: Energy
de: Energie
ja: エネルギー

# cat_power
source: Power
de: Leistung
ja: 仕事率

# cat_angle
source: Angle
de: Winkel
ja: 角度

# cat_force
source: Force
de: Kraft
ja: 力

# cat_frequency
source: Frequency
de: Frequenz
ja: 周波数

# cat_fuel
source: Fuel Economy
de: Kraftstoffverbrauch
ja: 燃費

# cat_cooking
source: Cooking
de: Kochen
ja: 料理

# u_centimeter
source: Centimeter
de: Zentimeter
ja: センチメートル

# u_micrometer
source: Micrometer
de: Mikrometer
ja: マイクロメートル

# u_mile
source: Mile
de: Meile
ja: マイル

# u_foot
source: Foot
de: Fuß
ja: フィート

# u_inch
source: Inch
de: Zoll
ja: インチ

# u_nautical_mile
source: Nautical Mile
de: Seemeile
ja: 海里

# u_light_year
source: Light Year
de: Lichtjahr
ja: 光年

# u_metric_ton
source: Metric Ton
de: Tonne
ja: トン

# u_kilogram
source: Kilogram
de: Kilogramm
ja: キログラム

# u_gram
source: Gram
de: Gramm
ja: グラム

# u_milligram
source: Milligram
de: Milligramm
ja: ミリグラム

# u_microgram
source: Microgram
de: Mikrogramm
ja: マイクログラム

# u_pound
source: Pound
de: Pfund
ja: ポンド

# u_ounce
source: Ounce
de: Unze
ja: オンス

# u_carat
source: Carat
de: Karat
ja: カラット

# u_mps
source: Meters per second
de: Meter pro Sekunde
ja: メートル毎秒

# u_kmh
source: Kilometers per hour
de: Kilometer pro Stunde
ja: キロメートル毎時

# u_mph
source: Miles per hour
de: Meilen pro Stunde
ja: マイル毎時

# u_knot
source: Knot
de: Knoten
ja: ノット

# u_fps
source: Feet per second
de: Fuß pro Sekunde
ja: フィート毎秒

# u_cubic_meter
source: Cubic Meter
de: Kubikmeter
ja: 立方メートル

# u_cubic_cm
source: Cubic Centimeter
de: Kubikzentimeter
ja: 立方センチメートル

# u_us_gallon
source: Gallon (US)
de: Gallone (US)
ja: ガロン (米)

# u_us_cup
source: Cup (US)
de: Tasse (US)
ja: カップ (米)

# u_us_fl_oz
source: Fluid Ounce (US)
de: Flüssigunze (US)
ja: 液量オンス (米)

# u_imp_gallon
source: Gallon (UK)
de: Gallone (UK)
ja: ガロン (英)

# u_cubic_inch
source: Cubic Inch
de: Kubikzoll
ja: 立方インチ

# u_sq_kilometer
source: Square Kilometer
de: Quadratkilometer
ja: 平方キロメートル

# u_hectare
source: Hectare
de: Hektar
ja: ヘクタール

# u_sq_meter
source: Square Meter
de: Quadratmeter
ja: 平方メートル

# u_sq_centimeter
source: Square Centimeter
de: Quadratzentimeter
ja: 平方センチメートル

# u_sq_mile
source: Square Mile
de: Quadratmeile
ja: 平方マイル

# u_sq_yard
source: Square Yard
de: Quadratyard
ja: 平方ヤード

# u_sq_foot
source: Square Foot
de: Quadratfuß
ja: 平方フィート

# u_sq_inch
source: Square Inch
de: Quadratzoll
ja: 平方インチ

# u_nanosecond
source: Nanosecond
de: Nanosekunde
ja: ナノ秒

# u_microsecond
source: Microsecond
de: Mikrosekunde
ja: マイクロ秒

# u_millisecond
source: Millisecond
de: Millisekunde
ja: ミリ秒

# u_second
source: Second
de: Sekunde
ja: 秒

# u_hour
source: Hour
de: Stunde
ja: 時間

# u_day
source: Day
de: Tag
ja: 日

# u_week
source: Week
de: Woche
ja: 週

# u_month
source: Month
de: Monat
ja: 月

# u_year
source: Year
de: Jahr
ja: 年

# u_atmosphere
source: Atmosphere
de: Atmosphäre
ja: 気圧

# u_mmhg
source: Millimeter of Mercury
de: Millimeter Quecksilbersäule
ja: 水銀柱ミリメートル

# u_calorie
source: Calorie
de: Kalorie
ja: カロリー

# u_kilocalorie
source: Kilocalorie
de: Kilokalorie
ja: キロカロリー

# u_watt_hour
source: Watt-hour
de: Wattstunde
ja: ワット時

# u_kilowatt_hour
source: Kilowatt-hour
de: Kilowattstunde
ja: キロワット時

# u_electron_volt
source: Electronvolt
de: Elektronenvolt
ja: 電子ボルト

# u_foot_pound
source: Foot-pound
de: Fuß-Pfund
ja: フィートポンド

# u_horsepower
source: Horsepower (Mechanical)
de: Pferdestärke (mechanisch)
ja: 馬力 (機械)

# u_metric_hp
source: Horsepower (Metric)
de: Pferdestärke (metrisch)
ja: 馬力 (メートル法)

# u_btu_per_hour
source: BTU per hour
de: BTU pro Stunde
ja: 英熱量毎時

# u_ftlb_per_sec
source: Foot-pound per second
de: Fuß-Pfund pro Sekunde
ja: フィートポンド毎秒

# u_degree
source: Degree
de: Grad
ja: 度

# u_radian
source: Radian
de: Radiant
ja: ラジアン

# u_gradian
source: Gradian
de: Gon
ja: グラード

# u_arcminute
source: Arcminute
de: Bogenminute
ja: 分 (角度)

# u_arcsecond
source: Arcsecond
de: Bogensekunde
ja: 秒 (角度)

# u_revolution
source: Revolution
de: Umdrehung
ja: 回転

# u_dyne
source: Dyne
de: Dyn
ja: ダイン

# u_kilogram_force
source: Kilogram-force
de: Kilopond
ja: 重量キログラム

# u_rpm
source: Revolutions per minute
de: Umdrehungen pro Minute
ja: 回転毎分

# u_km_per_liter
source: Kilometers per liter
de: Kilometer pro Liter
ja: キロメートル毎リットル

# u_mpg_us
source: Miles per gallon (US)
de: Meilen pro Gallone (US)
ja: マイル毎ガロン (米)

# u_mpg_uk
source: Miles per gallon (UK)
de: Meilen pro Gallone (UK)
ja: マイル毎ガロン (英)

# u_miles_per_liter
source: Miles per liter
de: Meilen pro Liter
ja: マイル毎リットル

# u_teaspoon
source: Teaspoon
de: Teelöffel
ja: 小さじ

# u_tablespoon
source: Tablespoon
de: Esslöffel
ja: 大さじ

# u_cup_us
source: Cup (US)
de: Tasse (US)
ja: カップ (米)

# u_cup_metric
source: Cup (Metric)
de: Tasse (metrisch)
ja: カップ (メートル法)

# u_kilometer
source: Kilometer
ja: キロメートル

# u_meter
source: Meter
ja: メートル

# u_millimeter
source: Millimeter
ja: ミリメートル

# u_nanometer
source: Nanometer
ja: ナノメートル

# u_yard
source: Yard
ja: ヤード

# u_stone
source: Stone
ja: ストーン

# u_short_ton
source: Short Ton (US)
ja: 米トン

# u_long_ton
source: Long Ton (UK)
ja: 英トン

# u_celsius
source: Celsius
ja: 摂氏

# u_fahrenheit
source: Fahrenheit
ja: 華氏

# u_kelvin
source: Kelvin
ja: ケルビン

# u_mach
source: Mach
ja: マッハ

# u_liter
source: Liter
ja: リットル

# u_milliliter
source: Milliliter
ja: ミリリットル

# u_us_quart
source: Quart (US)
ja: クォート (米)

# u_us_pint
source: Pint (US)
ja: パイント (米)

# u_acre
source: Acre
ja: エーカー

# u_bit
source: Bit
ja: ビット

# u_byte
source: Byte
ja: バイト

# u_kilobit
source: Kilobit
ja: キロビット

# u_kilobyte
source: Kilobyte
ja: キロバイト

# u_megabit
source: Megabit
ja: メガビット

# u_megabyte
source: Megabyte
ja: メガバイト

# u_gigabit
source: Gigabit
ja: ギガビット

# u_gigabyte
source: Gigabyte
ja: ギガバイト

# u_terabyte
source: Terabyte
ja: テラバイト

# u_petabyte
source: Petabyte
ja: ペタバイト

# u_minute
source: Minute
ja: 分

# u_pascal
source: Pascal
ja: パスカル

# u_kilopascal
source: Kilopascal
ja: キロパスカル

# u_bar
source: Bar
ja: バール

# u_torr
source: Torr
ja: トル

# u_joule
source: Joule
ja: ジュール

# u_kilojoule
source: Kilojoule
ja: キロジュール

# u_btu
source: British Thermal Unit
ja: 英熱量

# u_watt
source: Watt
ja: ワット

# u_kilowatt
source: Kilowatt
ja: キロワット

# u_megawatt
source: Megawatt
ja: メガワット

# u_newton
source: Newton
ja: ニュートン

# u_kilonewton
source: Kilonewton
ja: キロニュートン

# u_pound_force
source: Pound-force
ja: 重量ポンド

# u_ounce_force
source: Ounce-force
ja: 重量オンス

# u_hertz
source: Hertz
ja: ヘルツ

# u_kilohertz
source: Kilohertz
ja: キロヘルツ

# u_megahertz
source: Megahertz
ja: メガヘルツ

# u_gigahertz
source: Gigahertz
ja: ギガヘルツ
